Revit 2024 API
BuiltInFailures.StairRampFailures.NoRailingsStringer Property
 Railings and Stringers will not be automatically generated due to bad Runs. This message may be incorrect if you have Edited the Sketch and modified some dimensions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NoRailingsStringer { get; }
Visual Basic
Public Shared ReadOnly Property NoRailingsStringer As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NoRailingsStringer {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace